

[
    {
        "id": 0,
        "title": "MCD: Modele conceptuel de données",
        "image": "../assets/media/MeriseMCD.png",
        "important": true,
        "type": "merise",
        "resume": "Focalisé sur les besoins, relations et logique; base pour MLD.",
        "description": "Il est principalement axé sur la compréhension des besoins en termes d informations, des relations entre les données et de la logique sous-jacente, sans se préoccuper des détails d'implémentation, tels que les types de bases de données ou la structure physique. Une fois le MCD établi, il sert de base pour créer le modèle logique de données (MLD), qui définit comment les données seront stockées dans une base de données relationnelle ou autre."
    },
    {
        "id": 1,
        "title": "MLD : Modèle logique des données ",
        "image": "../assets/media/MeriseMLD.png",
        "important": true,
        "type": "merise",
        "resume": "Base pour la création et la gestionde la BDD, en précisant comment les données doivent être structurées",
        "description": "Un MCD est une représentation abstraite des données, qui décrit comment les données sont organisées, stockées et manipulées dans un système d'information. Il définit les entités, les relations, les attributs et les contraintes qui structurent les données, offrant ainsi une vue conceptuelle qui facilite la communication entre les concepteurs de BDD et les utilisateurs finaux."
    },
    {
        "id": 2,
        "title": "MOD : Modele organisationnel des donnees",
        "image": "#",
        "important": false,
        "type": "merise",
        "resume": "test",
        "description": "test"
    },
    {
        "id": 3,
        "title": "MPD: Modele physique de donnees",
        "image": "../assets/media/MeriseMPD.webp",
        "important": true,
        "type": "merise",
        "resume": "Une représentation concrète et technique des données",
        "description": " Il définit la manière dont les données sont stockées, organisées et accédées dans un système informatique. Ce modèle inclut des détails tels que les structures de tables, les index, les contraintes, les types de données, et la manière dont les données sont réellement stockées sur un support physique."
    },
    {
        "id": 4,
        "title": "MCT : Modèle conceptuel des traitements",
        "image": "#",
        "important": true,
        "type": "merise",
        "resume": "Le MCT est une représentation abstraite des processus, des opérations et des flux d'informations.",
        "description": "Ce modèle définit comment les données sont traitées, transformées et acheminées à travers un système, offrant ainsi une vue conceptuelle qui facilite la compréhension des fonctionnalités essentielles d'un système sans se préoccuper de la manière dont elles sont exécutées techniquement."
    },
    {
        "id": 5,
        "title": "MOT: Modèle organisationnel des traitements",
        "image": "#",
        "important": false,
        "type": "merise",
        "resume": "test",
        "description": "test"
    },
    {
        "id": 6,
        "title": "MLT : Modèle Logique des Traitements",
        "image": "#",
        "important": true,
        "type": "merise",
        "resume": "Le MLT est une représentation intermédiaire entre le modèle conceptuel et le modèle physique de traitement",
        "description": "Ce modèle définit la séquence, la structure, et les règles de traitement des données, mettant en évidence les opérations, les étapes et les interactions essentielles du système. Il facilite la communication entre les concepteurs et les développeurs"
    },
    {
        "id": 7,
        "title": "MPT : Modele Physique de traitements",
        "image": "#",
        "important": true,
        "type": "merise",
        "resume": "Le MPT est une représentation détaillée et spécifique des processus, des opérations et des flux de données. ",
        "description": "Il se focalise sur les aspects techniques et concrets de la mise en œuvre. Ce modèle définit comment les traitements sont exécutés, quels équipements et ressources sont utilisés, ainsi que les spécifications de données nécessaires pour l'exécution des processus. Il joue un rôle crucial dans la mise en place effective des systèmes informatiques en guidant les programmeurs dans la création de logiciels, la configuration matérielle et le déploiement des applications."
    },
    {
        "id": 8,
        "title": "MCC : Modèle conceptuel de communication ",
        "image": "#",
        "important": false,
        "type": "merise",
        "resume": "Une représentation abstraite des éléments, des interactions et des flux d'information au sein d'un système de communication ou d'échange d'informations. ",
        "description": "Ce modèle vise à définir les principaux concepts et à clarifier la manière dont les informations circulent entre les entités du système, facilitant ainsi la compréhension des interactions essentielles au sein d'un environnement de communication, que ce soit dans les domaines des télécommunications, de l'informatique ou d'autres domaines liés à la transmission d'informations."
    },
    {
        "id": 9,
        "title": "MOC : Modele organisationnel de communication",
        "image": "#",
        "important": false,
        "type": "merise",
        "resume": "Une représentation structurée des processus, des acteurs et des flux d'information au sein d'une organisation ou d'un système complexe.",
        "description": "Il se concentre sur la manière dont les activités de communication sont organisées, coordonnées et gérées au sein de l'entité, en mettant en évidence les rôles, les responsabilités, les canaux de communication, et les protocoles. Ce modèle vise à clarifier les relations et les interactions entre les différentes parties prenantes et à assurer une gestion efficace de la communication interne et externe au sein de l'organisation."
    },
    {
        "id": 10,
        "title": "MLC : Modele logique de Communication ",
        "image": "#",
        "important": false,
        "type": "merise",
        "resume": "Une représentation intermédiaire entre le modèle conceptuel et le modèle physique de communication.",
        "description": " Ce modèle définit les flux d'information, les canaux de communication, les formats de données, et les règles de transmission, facilitant ainsi la conception des systèmes de communication sans entrer dans les spécificités de l'infrastructure matérielle ou des protocoles de communication. Il joue un rôle essentiel dans la planification et la conception des systèmes de communication."
    },
    {
        "id": 11,
        "title": "MPC : Modele physique de Communication ",
        "image": "#",
        "important": true,
        "type": "merise",
        "resume": "Une représentation détaillée et spécifique des composants matériels, des protocoles, et de l'infrastructure nécessaire à la transmission et à la réception des données dans un système de communication.",
        "description": " Il se concentre sur les aspects techniques concrets, tels que les équipements, les câblages, les fréquences, les débits, les protocoles de communication, et les spécifications physiques des canaux de transmission. Ce modèle décrit comment les données sont transmises de manière pratique et efficace, et il est essentiel pour l'implémentation et la maintenance des réseaux de communication, des systèmes de télécommunication et d'autres infrastructures de transmission de données."
    }
]
